rtkconnectivity/hal_realtek/bee/drivers/enh_tim/src/rtl87x3e/rtl_enhtim_def.h
/* 0x134
   0       R/W    Enhtimer0_Interrupt_enable                  1'h0
   1       R/W    Enhtimer1_Interrupt_enable                  1'h0
   2       R/W    Enhtimer2_Interrupt_enable                  1'h0
   3       R/W    Enhtimer3_Interrupt_enable                  1'h0
   4       R/W    Enhtimer4_Interrupt_enable                  1'h0
   5       R/W    Enhtimer5_Interrupt_enable                  1'h0
   6       R/W    Enhtimer6_Interrupt_enable                  1'h0
   7       R/W    Enhtimer7_Interrupt_enable                  1'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer0_Interrupt_enable: 1;
        __IO uint32_t Enhtimer1_Interrupt_enable: 1;
        __IO uint32_t Enhtimer2_Interrupt_enable: 1;
        __IO uint32_t Enhtimer3_Interrupt_enable: 1;
        __IO uint32_t Enhtimer4_Interrupt_enable: 1;
        __IO uint32_t Enhtimer5_Interrupt_enable: 1;
        __IO uint32_t Enhtimer6_Interrupt_enable: 1;
        __IO uint32_t Enhtimer7_Interrupt_enable: 1;
        __IO uint32_t reserved_0: 24;
    } b;
} ENHTIM_INT_CONTROL_t;



/* 0x138
   0       R/W1C  Enhtimer0_Status                            1'h0
   1       R/W1C  Enhtimer1_Status                            1'h0
   2       R/W1C  Enhtimer2_Status                            1'h0
   3       R/W1C  Enhtimer3_Status                            1'h0
   4       R/W1C  Enhtimer4_Status                            1'h0
   5       R/W1C  Enhtimer5_Status                            1'h0
   6       R/W1C  Enhtimer6_Status                            1'h0
   7       R/W1C  Enhtimer7_Status                            1'h0
   8       R/W1C  Enhtimer0_latch_cnt_0_fifo_intr_status      1'h0
   9       R/W1C  Enhtimer1_latch_cnt_0_fifo_intr_status      1'h0
   10      R/W1C  Enhtimer2_latch_cnt_0_fifo_intr_status      1'h0
   11      R/W1C  Enhtimer3_latch_cnt_0_fifo_intr_status      1'h0
   12      R/W1C  Enhtimer4_latch_cnt_0_fifo_intr_status      1'h0
   13      R/W1C  Enhtimer5_latch_cnt_0_fifo_intr_status      1'h0
   14      R/W1C  Enhtimer6_latch_cnt_0_fifo_intr_status      1'h0
   15      R/W1C  Enhtimer7_latch_cnt_0_fifo_intr_status      1'h0
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer0_Status: 1;
        __IO uint32_t Enhtimer1_Status: 1;
        __IO uint32_t Enhtimer2_Status: 1;
        __IO uint32_t Enhtimer3_Status: 1;
        __IO uint32_t Enhtimer4_Status: 1;
        __IO uint32_t Enhtimer5_Status: 1;
        __IO uint32_t Enhtimer6_Status: 1;
        __IO uint32_t Enhtimer7_Status: 1;
        __IO uint32_t Enhtimer0_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_intr_status: 1;
        __IO uint32_t reserved_0: 16;
    } b;
} ENHTIM_STATUS_t;



/* 0x13C
   0       R      reg_timer_0_interrupt_masked                1'h0
   1       R      reg_timer_1_interrupt_masked                1'h0
   2       R      reg_timer_2_interrupt_masked                1'h0
   3       R      reg_timer_3_interrupt_masked                1'h0
   4       R      reg_timer_4_interrupt_masked                1'h0
   5       R      reg_timer_5_interrupt_masked                1'h0
   6       R      reg_timer_6_interrupt_masked                1'h0
   7       R      reg_timer_7_interrupt_masked                1'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t reg_timer_0_interrupt_masked: 1;
        __I uint32_t reg_timer_1_interrupt_masked: 1;
        __I uint32_t reg_timer_2_interrupt_masked: 1;
        __I uint32_t reg_timer_3_interrupt_masked: 1;
        __I uint32_t reg_timer_4_interrupt_masked: 1;
        __I uint32_t reg_timer_5_interrupt_masked: 1;
        __I uint32_t reg_timer_6_interrupt_masked: 1;
        __I uint32_t reg_timer_7_interrupt_masked: 1;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM_INT_STATUS_t;



/* 0x140
   7:0     R      RSVD                                        8'h0
   8       R/W    Enhtimer0_latch_cnt_0_fifo_full_intr_en     1'h0
   9       R/W    Enhtimer1_latch_cnt_0_fifo_full_intr_en     1'h0
   10      R/W    Enhtimer2_latch_cnt_0_fifo_full_intr_en     1'h0
   11      R/W    Enhtimer3_latch_cnt_0_fifo_full_intr_en     1'h0
   12      R/W    Enhtimer4_latch_cnt_0_fifo_full_intr_en     1'h0
   13      R/W    Enhtimer5_latch_cnt_0_fifo_full_intr_en     1'h0
   14      R/W    Enhtimer6_latch_cnt_0_fifo_full_intr_en     1'h0
   15      R/W    Enhtimer7_latch_cnt_0_fifo_full_intr_en     1'h0
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t reserved_16: 8;
        __IO uint32_t Enhtimer0_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_full_intr_en: 1;
        __IO uint32_t reserved_0: 16;
    } b;
} ENHTIM_LATCH_INT_CONTROL_0_t;



/* 0x148
   7:0     R      RSVD                                        8'h0
   8       R/W    Enhtimer0_latch_cnt_0_fifo_met_th_intr_en   1'h0
   9       R/W    Enhtimer1_latch_cnt_0_fifo_met_th_intr_en   1'h0
   10      R/W    Enhtimer2_latch_cnt_0_fifo_met_th_intr_en   1'h0
   11      R/W    Enhtimer3_latch_cnt_0_fifo_met_th_intr_en   1'h0
   12      R/W    Enhtimer4_latch_cnt_0_fifo_met_th_intr_en   1'h0
   13      R/W    Enhtimer5_latch_cnt_0_fifo_met_th_intr_en   1'h0
   14      R/W    Enhtimer6_latch_cnt_0_fifo_met_th_intr_en   1'h0
   15      R/W    Enhtimer7_latch_cnt_0_fifo_met_th_intr_en   1'h0
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I  uint32_t reserved_1: 8;
        __IO uint32_t Enhtimer0_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_met_th_intr_en: 1;
        __IO uint32_t reserved_0: 16;
    } b;
} ENHTIM_LATCH_INT_CONTROL_2_t;




/* 0x150
   7:0     R      Enhtimer0_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer0_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM0_LATCH_FIFO_DEPTH_t;



/* 0x154
   7:0     R      Enhtimer1_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer1_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM1_LATCH_FIFO_DEPTH_t;



/* 0x158
   7:0     R      Enhtimer2_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer2_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM2_LATCH_FIFO_DEPTH_t;



/* 0x15C
   7:0     R      Enhtimer3_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer3_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM3_LATCH_FIFO_DEPTH_t;



